#include "pwm.h"

/*********************************************************************************
			  ___   _     _____  _____  _   _  _____  _____  _   __
			 / _ \ | |   |_   _||  ___|| \ | ||_   _||  ___|| | / /
			/ /_\ \| |     | |  | |__  |  \| |  | |  | |__  | |/ /
			|  _  || |     | |  |  __| | . ` |  | |  |  __| |    \
			| | | || |_____| |_ | |___ | |\  |  | |  | |___ | |\  \
			\_| |_/\_____/\___/ \____/ \_| \_/  \_/  \____/ \_| \_/

 *	******************************************************************************
 *	本程序只供学习使用，未经作者许可，不得用于其它任何用途
 *	ALIENTEK W601开发板
 *	PWM驱动代码
 *	正点原子@ALIENTEK
 *	技术论坛:www.openedv.com
 *	创建日期:2019/7/10
 *	版本：V1.0
 *	版权所有，盗版必究。
 *	Copyright(C) 广州市星翼电子科技有限公司 2019-2029
 *	All rights reserved
 *	******************************************************************************
 *	初始版本
 *	******************************************************************************/



/**
 * @brief	PWM0输出初始化函数
 *
 * @param   freq	PWM频率，范围1~156250
 * @param   duty	PWM占空比 	duty/256
 *
 * @return  void
 */
void PWM0_Init(u32 freq, u8 duty)
{
    /*1.PWM输出IO配置  PB30*/
    wm_pwm1_config(WM_IO_PB_30);

    /*2.PWM参数配置*/
    tls_pwm_init(0, freq, duty, 0);

    /*3.开始PWM输出*/
    tls_pwm_start(0);
}



/**
 * @brief	设置PWM0的占空比
 *
 * @param   duty		占空比  duty/256
 *
 * @return  void
 */
void PWM0_Duty_Set(u8 duty)
{
    tls_pwm_duty_set(0, duty);
}

