#include "sys.h"
#include "wdt.h"

/*********************************************************************************
			  ___   _     _____  _____  _   _  _____  _____  _   __
			 / _ \ | |   |_   _||  ___|| \ | ||_   _||  ___|| | / /
			/ /_\ \| |     | |  | |__  |  \| |  | |  | |__  | |/ /
			|  _  || |     | |  |  __| | . ` |  | |  |  __| |    \
			| | | || |_____| |_ | |___ | |\  |  | |  | |___ | |\  \
			\_| |_/\_____/\___/ \____/ \_| \_/  \_/  \____/ \_| \_/

 *	******************************************************************************
 *	本程序只供学习使用，未经作者许可，不得用于其它任何用途
 *	ALIENTEK W601开发板
 *	独立看门狗驱动代码
 *	正点原子@ALIENTEK
 *	技术论坛:www.openedv.com
 *	创建日期:2019/7/10
 *	版本：V1.0
 *	版权所有，盗版必究。
 *	Copyright(C) 广州市星翼电子科技有限公司 2019-2029
 *	All rights reserved
 *	******************************************************************************
 *	初始版本
 *	******************************************************************************/


static u8 flag_wdt  = true;	//第一次进入看门狗中断标志

/**
 * @brief	初始化看门狗函数
 *			时间计算(大概):Tout= 40 * nus (us)
 *
 * @param  nus	看门狗复位时间（单位us）
 *
 * @return  void
 */
void WDT_Init(u32 nus)
{
    /************************************注意***************************************
    W601看门狗溢出说明：看门狗第一次溢出时，WDG会产生定时中断(此时不会产生复位),
    如果在第二次溢出之前没有清空中断标志，W601就会产生复位。
    所以看门狗实际溢出时间为 (nus*2)
    */
    tls_sys_clk sysclk;

    /*1.配置看门狗加载值，看门狗时钟为APB时钟，当前为40MHz，
    	看门狗最大计数:2^32/40 ≈ 107374182(us)*/
    tls_sys_clk_get(&sysclk);
    tls_reg_write32(HR_WDG_LOAD_VALUE, sysclk.apbclk * nus);

    /*2.开启看门狗定时器和看门狗复位时产生复位信号*/
    tls_reg_write32(HR_WDG_CTRL, 0x3);

    /*3.开启看门狗中断*/
    tls_irq_enable(WDG_IRQn);
}

/**
 * @brief	喂看门狗
 *
 * @param   void
 *
 * @return  void
 */
void WDT_Feed(void)
{
    tls_reg_write32(HR_WDG_INT_CLR, 0x01);

    flag_wdt  = true;
}

/**
 * @brief	看门狗中断服务函数
 *
 * @param   void
 *
 * @return  void
 */
void WDG_IRQHandler(void)
{
    if(flag_wdt)
    {
        printf("看门狗第一次中断\r\n");
    }

    flag_wdt = false;
}
