#ifndef __RTC_H
#define __RTC_H

#include "sys.h"

/*********************************************************************************
			  ___   _     _____  _____  _   _  _____  _____  _   __
			 / _ \ | |   |_   _||  ___|| \ | ||_   _||  ___|| | / /
			/ /_\ \| |     | |  | |__  |  \| |  | |  | |__  | |/ /
			|  _  || |     | |  |  __| | . ` |  | |  |  __| |    \
			| | | || |_____| |_ | |___ | |\  |  | |  | |___ | |\  \
			\_| |_/\_____/\___/ \____/ \_| \_/  \_/  \____/ \_| \_/

 *	******************************************************************************
 *	本程序只供学习使用，未经作者许可，不得用于其它任何用途
 *	ALIENTEK W601开发板
 *	RTC驱动代码
 *	正点原子@ALIENTEK
 *	技术论坛:www.openedv.com
 *	创建日期:2019/7/10
 *	版本：V1.0
 *	版权所有，盗版必究。
 *	Copyright(C) 广州市星翼电子科技有限公司 2019-2029
 *	All rights reserved
 *	******************************************************************************
 *	初始版本
 *	******************************************************************************/


#define RTC_Get_Week(y,m,d)	( ((d+2*m+3*(m+1)/5+y+y/4-y/100+y/400)%7+1)%7 )


void RTC_Init(u8 year, u8 month, u8 date, u8 hour, u8 min, u8 sec);
void RTC_Set_Date(u8 year, u8 month, u8 date, u8 hour, u8 min, u8 sec);
void RTC_Set_Alarm(u8 year, u8 month, u8 date, u8 hour, u8 min, u8 sec);
void RTC_Get_Date(struct tm *data);
#endif


